def str_upper(string):
    """
    Принимает на вход строку и возвращает ее со всеми заглавными буквами
    Так как я добавил докстринг, к этой функции ранее, делаю сейчас Задание 3 из Github,
    и добавляю здесь этот докстринг
    """
    return string.upper()

print(str_upper("ryan gosling"))

def str_title(string):
    """
    Принимает на вход строку, которая делает заглавными первые буквы каждого слова
    в строке, поступившей на вход функции
    """
    return string.title()

print(str_title("ryan gosling"))
